/* automatically generated by rust-bindgen 0.69.4 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const R43_HI: u32 = 87;
pub const R44_LO: u32 = 88;
pub const R44_HI: u32 = 89;
pub const R45_LO: u32 = 90;
pub const R45_HI: u32 = 91;
pub const R46_LO: u32 = 92;
pub const R46_HI: u32 = 93;
pub const R47_LO: u32 = 94;
pub const R47_HI: u32 = 95;
pub const R48_LO: u32 = 96;
pub const R48_HI: u32 = 97;
pub const R49_LO: u32 = 98;
pub const R49_HI: u32 = 99;
pub const R50_LO: u32 = 100;
pub const R50_HI: u32 = 101;
pub const R51_LO: u32 = 102;
pub const R51_HI: u32 = 103;
pub const R52_LO: u32 = 104;
pub const R52_HI: u32 = 105;
pub const R53_LO: u32 = 106;
pub const R53_HI: u32 = 107;
pub const R54_LO: u32 = 108;
pub const R54_HI: u32 = 109;
pub const R55_LO: u32 = 110;
pub const R55_HI: u32 = 111;
pub const R56_LO: u32 = 112;
pub const R56_HI: u32 = 113;
pub const R57_LO: u32 = 114;
pub const R57_HI: u32 = 115;
pub const R58_LO: u32 = 116;
pub const R58_HI: u32 = 117;
pub const R59_LO: u32 = 118;
pub const R59_HI: u32 = 119;
pub const R60_LO: u32 = 120;
pub const R60_HI: u32 = 121;
pub const R61_LO: u32 = 122;
pub const R61_HI: u32 = 123;
pub const R62_LO: u32 = 124;
pub const R62_HI: u32 = 125;
pub const R63_LO: u32 = 126;
pub const R63_HI: u32 = 127;
pub const TENSIX_MAX_KERNEL_LOOP_COUNT: u32 = 65535;
pub type __u_char = ::core::ffi::c_uchar;
pub type __u_short = ::core::ffi::c_ushort;
pub type __u_int = ::core::ffi::c_uint;
pub type __u_long = ::core::ffi::c_ulong;
pub type __int8_t = ::core::ffi::c_schar;
pub type __uint8_t = ::core::ffi::c_uchar;
pub type __int16_t = ::core::ffi::c_short;
pub type __uint16_t = ::core::ffi::c_ushort;
pub type __int32_t = ::core::ffi::c_int;
pub type __uint32_t = ::core::ffi::c_uint;
pub type __int64_t = ::core::ffi::c_long;
pub type __uint64_t = ::core::ffi::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::core::ffi::c_long;
pub type __u_quad_t = ::core::ffi::c_ulong;
pub type __intmax_t = ::core::ffi::c_long;
pub type __uintmax_t = ::core::ffi::c_ulong;
pub type __dev_t = ::core::ffi::c_ulong;
pub type __uid_t = ::core::ffi::c_uint;
pub type __gid_t = ::core::ffi::c_uint;
pub type __ino_t = ::core::ffi::c_ulong;
pub type __ino64_t = ::core::ffi::c_ulong;
pub type __mode_t = ::core::ffi::c_uint;
pub type __nlink_t = ::core::ffi::c_ulong;
pub type __off_t = ::core::ffi::c_long;
pub type __off64_t = ::core::ffi::c_long;
pub type __pid_t = ::core::ffi::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::core::ffi::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    const UNINIT: ::core::mem::MaybeUninit<__fsid_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::core::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).__val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::core::ffi::c_long;
pub type __rlim_t = ::core::ffi::c_ulong;
pub type __rlim64_t = ::core::ffi::c_ulong;
pub type __id_t = ::core::ffi::c_uint;
pub type __time_t = ::core::ffi::c_long;
pub type __useconds_t = ::core::ffi::c_uint;
pub type __suseconds_t = ::core::ffi::c_long;
pub type __daddr_t = ::core::ffi::c_int;
pub type __key_t = ::core::ffi::c_int;
pub type __clockid_t = ::core::ffi::c_int;
pub type __timer_t = *mut ::core::ffi::c_void;
pub type __blksize_t = ::core::ffi::c_long;
pub type __blkcnt_t = ::core::ffi::c_long;
pub type __blkcnt64_t = ::core::ffi::c_long;
pub type __fsblkcnt_t = ::core::ffi::c_ulong;
pub type __fsblkcnt64_t = ::core::ffi::c_ulong;
pub type __fsfilcnt_t = ::core::ffi::c_ulong;
pub type __fsfilcnt64_t = ::core::ffi::c_ulong;
pub type __fsword_t = ::core::ffi::c_long;
pub type __ssize_t = ::core::ffi::c_long;
pub type __syscall_slong_t = ::core::ffi::c_long;
pub type __syscall_ulong_t = ::core::ffi::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::core::ffi::c_char;
pub type __intptr_t = ::core::ffi::c_long;
pub type __socklen_t = ::core::ffi::c_uint;
pub type __sig_atomic_t = ::core::ffi::c_int;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::core::ffi::c_schar;
pub type int_fast16_t = ::core::ffi::c_long;
pub type int_fast32_t = ::core::ffi::c_long;
pub type int_fast64_t = ::core::ffi::c_long;
pub type uint_fast8_t = ::core::ffi::c_uchar;
pub type uint_fast16_t = ::core::ffi::c_ulong;
pub type uint_fast32_t = ::core::ffi::c_ulong;
pub type uint_fast64_t = ::core::ffi::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub const xmov_direction_t_XMOV_L0_TO_L1: xmov_direction_t = 0;
pub const xmov_direction_t_XMOV_L1_TO_L0: xmov_direction_t = 1;
pub const xmov_direction_t_XMOV_L0_TO_L0: xmov_direction_t = 2;
pub const xmov_direction_t_XMOV_L1_TO_L1: xmov_direction_t = 3;
pub type xmov_direction_t = ::core::ffi::c_uint;
pub const tdma_mover_id_t_TDMA_MOVER0: tdma_mover_id_t = 0;
pub const tdma_mover_id_t_TDMA_MOVER1: tdma_mover_id_t = 1;
pub type tdma_mover_id_t = ::core::ffi::c_uint;
pub const math_fidelity_t_MATH_HF: math_fidelity_t = 1;
pub const math_fidelity_t_MATH_AUTO: math_fidelity_t = 2;
pub const math_fidelity_t_MATH_LF: math_fidelity_t = 4;
pub type math_fidelity_t = ::core::ffi::c_uint;
pub const relu_mode_t_RELU_NONE: relu_mode_t = 0;
pub const relu_mode_t_RELU_PLAIN: relu_mode_t = 1;
pub const relu_mode_t_RELU_THRESH: relu_mode_t = 2;
pub const relu_mode_t_RELU_MAX: relu_mode_t = 3;
pub type relu_mode_t = ::core::ffi::c_uint;
pub const stochastic_round_settings_t_STOCH_RND_NONE: stochastic_round_settings_t = 0;
pub const stochastic_round_settings_t_STOCH_RND_FPU: stochastic_round_settings_t = 1;
pub const stochastic_round_settings_t_STOCH_RND_GASKET: stochastic_round_settings_t = 2;
pub const stochastic_round_settings_t_STOCH_RND_PACKER: stochastic_round_settings_t = 4;
pub type stochastic_round_settings_t = ::core::ffi::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct packer_config_t {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 16usize]>,
}
#[test]
fn bindgen_test_layout_packer_config_t() {
    assert_eq!(
        ::core::mem::size_of::<packer_config_t>(),
        16usize,
        concat!("Size of: ", stringify!(packer_config_t))
    );
    assert_eq!(
        ::core::mem::align_of::<packer_config_t>(),
        4usize,
        concat!("Alignment of ", stringify!(packer_config_t))
    );
}
impl packer_config_t {
    #[inline]
    pub fn row_section_size(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_row_section_size(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn exp_section_size(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_exp_section_size(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn tile_dst_addr(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_tile_dst_addr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn uncompressed(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(64usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_uncompressed(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(64usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved_0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(65usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_reserved_0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(65usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn out_data_format(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(68usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_out_data_format(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(68usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved_1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(70usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_reserved_1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(70usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn in_data_format(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(72usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_in_data_format(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(72usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved_2(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(74usize, 22u8) as u32) }
    }
    #[inline]
    pub fn set_reserved_2(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(74usize, 22u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved_3(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(96usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_reserved_3(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(96usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        row_section_size: u32,
        exp_section_size: u32,
        tile_dst_addr: u32,
        uncompressed: u32,
        reserved_0: u32,
        out_data_format: u32,
        reserved_1: u32,
        in_data_format: u32,
        reserved_2: u32,
        reserved_3: u32,
    ) -> __BindgenBitfieldUnit<[u8; 16usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 16usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 16u8, {
            let row_section_size: u32 = unsafe { ::core::mem::transmute(row_section_size) };
            row_section_size as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let exp_section_size: u32 = unsafe { ::core::mem::transmute(exp_section_size) };
            exp_section_size as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let tile_dst_addr: u32 = unsafe { ::core::mem::transmute(tile_dst_addr) };
            tile_dst_addr as u64
        });
        __bindgen_bitfield_unit.set(64usize, 1u8, {
            let uncompressed: u32 = unsafe { ::core::mem::transmute(uncompressed) };
            uncompressed as u64
        });
        __bindgen_bitfield_unit.set(65usize, 3u8, {
            let reserved_0: u32 = unsafe { ::core::mem::transmute(reserved_0) };
            reserved_0 as u64
        });
        __bindgen_bitfield_unit.set(68usize, 2u8, {
            let out_data_format: u32 = unsafe { ::core::mem::transmute(out_data_format) };
            out_data_format as u64
        });
        __bindgen_bitfield_unit.set(70usize, 2u8, {
            let reserved_1: u32 = unsafe { ::core::mem::transmute(reserved_1) };
            reserved_1 as u64
        });
        __bindgen_bitfield_unit.set(72usize, 2u8, {
            let in_data_format: u32 = unsafe { ::core::mem::transmute(in_data_format) };
            in_data_format as u64
        });
        __bindgen_bitfield_unit.set(74usize, 22u8, {
            let reserved_2: u32 = unsafe { ::core::mem::transmute(reserved_2) };
            reserved_2 as u64
        });
        __bindgen_bitfield_unit.set(96usize, 32u8, {
            let reserved_3: u32 = unsafe { ::core::mem::transmute(reserved_3) };
            reserved_3 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fifo_ctl_t {
    pub rd_ptr: u32,
    pub wr_ptr: u32,
    pub rsvd0: u32,
    pub rsvd1: u32,
}
#[test]
fn bindgen_test_layout_fifo_ctl_t() {
    const UNINIT: ::core::mem::MaybeUninit<fifo_ctl_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<fifo_ctl_t>(),
        16usize,
        concat!("Size of: ", stringify!(fifo_ctl_t))
    );
    assert_eq!(
        ::core::mem::align_of::<fifo_ctl_t>(),
        4usize,
        concat!("Alignment of ", stringify!(fifo_ctl_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rd_ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(fifo_ctl_t),
            "::",
            stringify!(rd_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).wr_ptr) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(fifo_ctl_t),
            "::",
            stringify!(wr_ptr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rsvd0) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(fifo_ctl_t),
            "::",
            stringify!(rsvd0)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rsvd1) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(fifo_ctl_t),
            "::",
            stringify!(rsvd1)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct packer_config_u {
    pub val: [u32; 4usize],
    pub f: packer_config_t,
}
#[test]
fn bindgen_test_layout_packer_config_u() {
    const UNINIT: ::core::mem::MaybeUninit<packer_config_u> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<packer_config_u>(),
        32usize,
        concat!("Size of: ", stringify!(packer_config_u))
    );
    assert_eq!(
        ::core::mem::align_of::<packer_config_u>(),
        4usize,
        concat!("Alignment of ", stringify!(packer_config_u))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(packer_config_u),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).f) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(packer_config_u),
            "::",
            stringify!(f)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mover_config_t {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 16usize]>,
}
#[test]
fn bindgen_test_layout_mover_config_t() {
    assert_eq!(
        ::core::mem::size_of::<mover_config_t>(),
        16usize,
        concat!("Size of: ", stringify!(mover_config_t))
    );
    assert_eq!(
        ::core::mem::align_of::<mover_config_t>(),
        4usize,
        concat!("Alignment of ", stringify!(mover_config_t))
    );
}
impl mover_config_t {
    #[inline]
    pub fn src_addr(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_src_addr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn dst_addr(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(32usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_dst_addr(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(32usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn xfer_size(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(64usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_xfer_size(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(64usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn xfer_dir(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(96usize, 2u8) as u32) }
    }
    #[inline]
    pub fn set_xfer_dir(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(96usize, 2u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved_0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(98usize, 30u8) as u32) }
    }
    #[inline]
    pub fn set_reserved_0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(98usize, 30u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        src_addr: u32,
        dst_addr: u32,
        xfer_size: u32,
        xfer_dir: u32,
        reserved_0: u32,
    ) -> __BindgenBitfieldUnit<[u8; 16usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 16usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 32u8, {
            let src_addr: u32 = unsafe { ::core::mem::transmute(src_addr) };
            src_addr as u64
        });
        __bindgen_bitfield_unit.set(32usize, 32u8, {
            let dst_addr: u32 = unsafe { ::core::mem::transmute(dst_addr) };
            dst_addr as u64
        });
        __bindgen_bitfield_unit.set(64usize, 32u8, {
            let xfer_size: u32 = unsafe { ::core::mem::transmute(xfer_size) };
            xfer_size as u64
        });
        __bindgen_bitfield_unit.set(96usize, 2u8, {
            let xfer_dir: u32 = unsafe { ::core::mem::transmute(xfer_dir) };
            xfer_dir as u64
        });
        __bindgen_bitfield_unit.set(98usize, 30u8, {
            let reserved_0: u32 = unsafe { ::core::mem::transmute(reserved_0) };
            reserved_0 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct mover_config_u {
    pub val: [u32; 4usize],
    pub f: mover_config_t,
}
#[test]
fn bindgen_test_layout_mover_config_u() {
    const UNINIT: ::core::mem::MaybeUninit<mover_config_u> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<mover_config_u>(),
        32usize,
        concat!("Size of: ", stringify!(mover_config_u))
    );
    assert_eq!(
        ::core::mem::align_of::<mover_config_u>(),
        4usize,
        concat!("Alignment of ", stringify!(mover_config_u))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(mover_config_u),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).f) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(mover_config_u),
            "::",
            stringify!(f)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tile_descriptor_t {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 18usize]>,
}
#[test]
fn bindgen_test_layout_tile_descriptor_t() {
    assert_eq!(
        ::core::mem::size_of::<tile_descriptor_t>(),
        20usize,
        concat!("Size of: ", stringify!(tile_descriptor_t))
    );
    assert_eq!(
        ::core::mem::align_of::<tile_descriptor_t>(),
        4usize,
        concat!("Alignment of ", stringify!(tile_descriptor_t))
    );
}
impl tile_descriptor_t {
    #[inline]
    pub fn data_format(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_data_format(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn uncompressed(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_uncompressed(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved_0(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 3u8) as u32) }
    }
    #[inline]
    pub fn set_reserved_0(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub fn blobs_per_xy_plane(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_blobs_per_xy_plane(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn reserved_1(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 4u8) as u32) }
    }
    #[inline]
    pub fn set_reserved_1(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 4u8, val as u64)
        }
    }
    #[inline]
    pub fn x_dim(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_x_dim(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn y_dim(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(32usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_y_dim(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(32usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn z_dim(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(48usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_z_dim(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(48usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn w_dim(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(64usize, 16u8) as u32) }
    }
    #[inline]
    pub fn set_w_dim(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(64usize, 16u8, val as u64)
        }
    }
    #[inline]
    pub fn blobs_y_start(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(96usize, 32u8) as u32) }
    }
    #[inline]
    pub fn set_blobs_y_start(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(96usize, 32u8, val as u64)
        }
    }
    #[inline]
    pub fn digest_type(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(128usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_digest_type(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(128usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn digest_size(&self) -> u32 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(136usize, 8u8) as u32) }
    }
    #[inline]
    pub fn set_digest_size(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::core::mem::transmute(val);
            self._bitfield_1.set(136usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        data_format: u32,
        uncompressed: u32,
        reserved_0: u32,
        blobs_per_xy_plane: u32,
        reserved_1: u32,
        x_dim: u32,
        y_dim: u32,
        z_dim: u32,
        w_dim: u32,
        blobs_y_start: u32,
        digest_type: u32,
        digest_size: u32,
    ) -> __BindgenBitfieldUnit<[u8; 18usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 18usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 4u8, {
            let data_format: u32 = unsafe { ::core::mem::transmute(data_format) };
            data_format as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let uncompressed: u32 = unsafe { ::core::mem::transmute(uncompressed) };
            uncompressed as u64
        });
        __bindgen_bitfield_unit.set(5usize, 3u8, {
            let reserved_0: u32 = unsafe { ::core::mem::transmute(reserved_0) };
            reserved_0 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 4u8, {
            let blobs_per_xy_plane: u32 = unsafe { ::core::mem::transmute(blobs_per_xy_plane) };
            blobs_per_xy_plane as u64
        });
        __bindgen_bitfield_unit.set(12usize, 4u8, {
            let reserved_1: u32 = unsafe { ::core::mem::transmute(reserved_1) };
            reserved_1 as u64
        });
        __bindgen_bitfield_unit.set(16usize, 16u8, {
            let x_dim: u32 = unsafe { ::core::mem::transmute(x_dim) };
            x_dim as u64
        });
        __bindgen_bitfield_unit.set(32usize, 16u8, {
            let y_dim: u32 = unsafe { ::core::mem::transmute(y_dim) };
            y_dim as u64
        });
        __bindgen_bitfield_unit.set(48usize, 16u8, {
            let z_dim: u32 = unsafe { ::core::mem::transmute(z_dim) };
            z_dim as u64
        });
        __bindgen_bitfield_unit.set(64usize, 16u8, {
            let w_dim: u32 = unsafe { ::core::mem::transmute(w_dim) };
            w_dim as u64
        });
        __bindgen_bitfield_unit.set(96usize, 32u8, {
            let blobs_y_start: u32 = unsafe { ::core::mem::transmute(blobs_y_start) };
            blobs_y_start as u64
        });
        __bindgen_bitfield_unit.set(128usize, 8u8, {
            let digest_type: u32 = unsafe { ::core::mem::transmute(digest_type) };
            digest_type as u64
        });
        __bindgen_bitfield_unit.set(136usize, 8u8, {
            let digest_size: u32 = unsafe { ::core::mem::transmute(digest_size) };
            digest_size as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union tile_descriptor_u {
    pub val: [u32; 4usize],
    pub f: tile_descriptor_t,
}
#[test]
fn bindgen_test_layout_tile_descriptor_u() {
    const UNINIT: ::core::mem::MaybeUninit<tile_descriptor_u> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<tile_descriptor_u>(),
        20usize,
        concat!("Size of: ", stringify!(tile_descriptor_u))
    );
    assert_eq!(
        ::core::mem::align_of::<tile_descriptor_u>(),
        4usize,
        concat!("Alignment of ", stringify!(tile_descriptor_u))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tile_descriptor_u),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).f) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(tile_descriptor_u),
            "::",
            stringify!(f)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct TileHeader {
    pub tile_size_16B: u16,
    pub _bitfield_align_1: [u16; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
    pub metadata_size_16B: u8,
    pub reserved_1: u8,
    pub format: u16,
    pub zero_mask: u32,
    pub reserved_3: u32,
}
#[test]
fn bindgen_test_layout_TileHeader() {
    const UNINIT: ::core::mem::MaybeUninit<TileHeader> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<TileHeader>(),
        16usize,
        concat!("Size of: ", stringify!(TileHeader))
    );
    assert_eq!(
        ::core::mem::align_of::<TileHeader>(),
        4usize,
        concat!("Alignment of ", stringify!(TileHeader))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tile_size_16B) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TileHeader),
            "::",
            stringify!(tile_size_16B)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).metadata_size_16B) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(TileHeader),
            "::",
            stringify!(metadata_size_16B)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved_1) as usize - ptr as usize },
        5usize,
        concat!(
            "Offset of field: ",
            stringify!(TileHeader),
            "::",
            stringify!(reserved_1)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(TileHeader),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).zero_mask) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(TileHeader),
            "::",
            stringify!(zero_mask)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved_3) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(TileHeader),
            "::",
            stringify!(reserved_3)
        )
    );
}
impl TileHeader {
    #[inline]
    pub fn reserved_0_mbz(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_reserved_0_mbz(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn tile_id(&self) -> u16 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 15u8) as u16) }
    }
    #[inline]
    pub fn set_tile_id(&mut self, val: u16) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 15u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        reserved_0_mbz: u16,
        tile_id: u16,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let reserved_0_mbz: u16 = unsafe { ::core::mem::transmute(reserved_0_mbz) };
            reserved_0_mbz as u64
        });
        __bindgen_bitfield_unit.set(1usize, 15u8, {
            let tile_id: u16 = unsafe { ::core::mem::transmute(tile_id) };
            tile_id as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union TileHeader_u {
    pub val: [u32; 4usize],
    pub header: TileHeader,
}
#[test]
fn bindgen_test_layout_TileHeader_u() {
    const UNINIT: ::core::mem::MaybeUninit<TileHeader_u> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<TileHeader_u>(),
        16usize,
        concat!("Size of: ", stringify!(TileHeader_u))
    );
    assert_eq!(
        ::core::mem::align_of::<TileHeader_u>(),
        4usize,
        concat!("Alignment of ", stringify!(TileHeader_u))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).val) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TileHeader_u),
            "::",
            stringify!(val)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).header) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(TileHeader_u),
            "::",
            stringify!(header)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SectionHeader {
    pub section_id: u16,
    pub section_size: u16,
    pub tile_count: u16,
    pub reserved: [u16; 5usize],
}
#[test]
fn bindgen_test_layout_SectionHeader() {
    const UNINIT: ::core::mem::MaybeUninit<SectionHeader> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<SectionHeader>(),
        16usize,
        concat!("Size of: ", stringify!(SectionHeader))
    );
    assert_eq!(
        ::core::mem::align_of::<SectionHeader>(),
        2usize,
        concat!("Alignment of ", stringify!(SectionHeader))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).section_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SectionHeader),
            "::",
            stringify!(section_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).section_size) as usize - ptr as usize },
        2usize,
        concat!(
            "Offset of field: ",
            stringify!(SectionHeader),
            "::",
            stringify!(section_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tile_count) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SectionHeader),
            "::",
            stringify!(tile_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).reserved) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SectionHeader),
            "::",
            stringify!(reserved)
        )
    );
}
pub const TEST_MSG_EN_TENSIX_PM: u32 = 0;
pub const TEST_MSG_DBG_DISABLE: u32 = 1;
pub const TEST_MSG_SET_MAX_EXP_THRESH: u32 = 2;
pub const TEST_MSG_RISC_BP_DISABLE: u32 = 3;
pub const TEST_MSG_SET_RELU_PARAMS: u32 = 4;
pub const TEST_MSG_SET_PRNG_SEED: u32 = 5;
pub const TEST_MSG_RISC_PREFETCHER_CTRL: u32 = 6;
pub const TEST_MSG_SYNTH_CKERNEL: u32 = 10;
pub const TEST_MSG_ONE_KERNEL: u32 = 11;
pub const TEST_MSG_WAIT_KERNELS: u32 = 12;
pub const TEST_MSG_WAIT_ONE_KERNEL: u32 = 13;
pub const TEST_MSG_SYNTH_TAG_SRCH: u32 = 14;
pub const COMMAND_QUEUE_SIZE_BYTES_LOG2: u32 = 16;
pub const COMMAND_QUEUE_SIZE_BYTES: u32 = 65536;
pub const COMMAND_SIZE_BYTES_LOG2: u32 = 5;
pub const COMMAND_SIZE_BYTES: u32 = 32;
pub const DEST_FACE_WIDTH: u32 = 16;
pub const DEST_FACE_HEIGHT: u32 = 16;
pub const DEST_REGISTER_FULL_SIZE: u32 = 1024;
